balazsgrill/modembed/res/Devices/dsPIC30/PIC24FV32KA301.PIC
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0x5800" edc:regionid="program"/>
    <edc:EEDataSector edc:beginaddr="0x7ffe00" edc:endaddr="0x800000" edc:regionid="eedata"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8007c0" edc:beginaddr="0x800000" edc:endaddr="0x800800" edc:regionid="testmem"/>
    <edc:DeviceIDSector edc:beginaddr="0xff0000" edc:endaddr="0xff0004" edc:mask="0xffff0000" edc:regionid="devid" edc:value="0x45190000"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x800000" edc:endaddr="0x800008" edc:regionid="debug"/>
    <edc:ConfigFuseSector edc:beginaddr="0xf80000" edc:endaddr="0xf80012" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="------------nnnn" edc:cname="FBS" edc:default="0xffff" edc:desc="" edc:impl="0xf" edc:name="FBS" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x000F">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BWRP" edc:desc="Boot Segment Write Protect" edc:mask="0x1" edc:name="BWRP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmBootWrtProtectOff" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmBootWrtProtectOn" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BSS" edc:desc="Boot segment Protect" edc:mask="0x7" edc:name="BSS" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmBootNone" edc:desc="No boot program flash segment" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="STD1K" edc:codeguardidref="PgmBootStdSm" edc:desc="Standard Security Boot Protect 000200h - 000AFEh" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="STD2K" edc:codeguardidref="PgmBootStdMed" edc:desc="Standard Security Boot Protect 000200h - 0015FEh" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="STD5K" edc:codeguardidref="PgmBootStdLarge" edc:desc="Standard Security Boot Protect 000200h - 002BFEh" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="HI1K" edc:codeguardidref="PgmBootHighSm" edc:desc="High Security Boot Protect 000200h - 000AFEh" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HI2K" edc:codeguardidref="PgmBootHighMed" edc:desc="High Security Boot Protect 000200h - 0015FEh" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HI5K" edc:codeguardidref="PgmBootHighLarge" edc:desc="High Security Boot Protect 000200h - 002BFEh" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:offset="2"/>
      <edc:DCRDef edc:access="--------------nn" edc:cname="FGS" edc:default="0xffff" edc:desc="" edc:impl="0x3" edc:name="FGS" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x0003">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenWrtProtectOff" edc:desc="General segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenWrtProtectOn" edc:desc="General segment is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GSS0" edc:desc="General Segment Code Protect" edc:mask="0x1" edc:name="GCP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:codeguardidref="PgmGenNone" edc:desc="No Protection" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:codeguardidref="PgmGenStd" edc:desc="Standard security enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x80" edc:endaddr="0x57ff"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnn--nnn" edc:cname="FOSCSEL" edc:default="0xffff" edc:desc="" edc:impl="0xE7" edc:name="FOSCSEL" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x00E7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Select" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="FRCDIV" edc:desc="8MHz FRC oscillator With Postscaler (FRCDIV)" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="LPFRC" edc:desc="500kHz Low-Power FRC oscillator with Postscaler(LPFRCDIV)" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary oscillator with PLL Module (HS+PLL, EC+PLL)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary Oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Fast RC Oscillator with Postscaler and PLL Module (FRCDIV+PLL)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Fast RC Oscillator (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="SOSCSRC" edc:desc="SOSC Source Type" edc:mask="0x1" edc:name="SOSCSRC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ANA" edc:desc="Analog Mode for use with crystal" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIG" edc:desc="Digital Mode for use with external source" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LPRCSEL" edc:desc="LPRC Oscillator Power and Accuracy" edc:mask="0x1" edc:name="LPRCSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="HP" edc:desc="High Power, High Accuracy Mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="Low Power, Low Accuracy Mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal External Switch Over bit" edc:mask="0x1" edc:name="IESO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Internal External Switchover mode enabled (Two-speed Start-up enabled)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Internal External Switchover mode disabled (Two-speed Start-up disabled)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
